// Задача 19
// Напишите программу, которая принимает на вход пятизначное число и
//  проверяет, является ли оно палиндромом.
// 14212 -> нет
// 12821 -> да
// 23432 -> да
System.Console.WriteLine("Введите пятизначное число");
int num = Convert.ToInt32(System.Console.ReadLine());
// System.Console.WriteLine(num/1000);
// System.Console.WriteLine(num%100);
